Revit 2027 API
IFCExtrusionCreationData.PossibleExtrusionAxes Property
 The axes to try when generating the properties of the extrusion.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IFCExtrusionAxes PossibleExtrusionAxes { get; set; }
Public Property PossibleExtrusionAxes As IFCExtrusionAxes
	Get
	Set
public:
property IFCExtrusionAxes PossibleExtrusionAxes {
	IFCExtrusionAxes get ();
	void set (IFCExtrusionAxes value);
}
member PossibleExtrusionAxes : IFCExtrusionAxes with get, set
Property Value
IFCExtrusionAxes
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
IFCExtrusionCreationData Class
Autodesk.Revit.DB.IFC Namespace